; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	instrument9 - instrument
	infrared1 - mode
	image2 - mode
	spectrograph3 - mode
	infrared0 - mode
	Star5 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star0 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument2 infrared0)
	(supports instrument2 image2)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 spectrograph3)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 spectrograph3)
	(calibration_target instrument4 GroundStation1)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star13)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 infrared0)
	(supports instrument6 spectrograph3)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 GroundStation6)
	(supports instrument7 infrared1)
	(supports instrument7 infrared0)
	(supports instrument7 spectrograph3)
	(calibration_target instrument7 Star0)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
	(supports instrument8 infrared0)
	(supports instrument8 spectrograph3)
	(calibration_target instrument8 GroundStation6)
	(calibration_target instrument8 GroundStation4)
	(supports instrument9 image2)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon12)
)
(:goal (and
	(have_image Star7 spectrograph3)
	(have_image Planet8 image2)
	(have_image Phenomenon9 image2)
	(have_image Planet10 image2)
	(have_image Planet11 spectrograph3)
	(have_image Phenomenon12 spectrograph3)
	(have_image Star13 infrared0)
	(have_image Star14 infrared0)
	(have_image Planet15 infrared1)
	(have_image Star16 infrared0)
))

)

; plan
1. (turn_to satellite2 star0 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star0)
   goals met: 0 of 10
2. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 10
3. (calibrate satellite2 instrument7 star0)
   added: (calibrated instrument7)
   goals met: 0 of 10
4. (turn_to satellite2 star13 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star13)
   goals met: 0 of 10
5. (take_image satellite2 star13 instrument7 infrared0)
   added: (have_image star13 infrared0)
   goals met: 1 of 10
6. (turn_to satellite2 planet15 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 planet15)
   goals met: 1 of 10
7. (take_image satellite2 planet15 instrument7 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 2 of 10
8. (turn_to satellite2 planet11 planet15)
   deleted: (pointing satellite2 planet15)
   added: (pointing satellite2 planet11)
   goals met: 2 of 10
9. (take_image satellite2 planet11 instrument7 spectrograph3)
   added: (have_image planet11 spectrograph3)
   goals met: 3 of 10
10. (turn_to satellite2 phenomenon12 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon12)
   goals met: 3 of 10
11. (turn_to satellite0 groundstation2 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 groundstation2)
   goals met: 3 of 10
12. (take_image satellite2 phenomenon12 instrument7 spectrograph3)
   added: (have_image phenomenon12 spectrograph3)
   goals met: 4 of 10
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 10
14. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 4 of 10
15. (turn_to satellite0 phenomenon9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 10
16. (take_image satellite0 phenomenon9 instrument0 image2)
   added: (have_image phenomenon9 image2)
   goals met: 5 of 10
17. (turn_to satellite0 planet10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet10)
   goals met: 5 of 10
18. (take_image satellite0 planet10 instrument0 image2)
   added: (have_image planet10 image2)
   goals met: 6 of 10
19. (turn_to satellite0 planet8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet8)
   goals met: 6 of 10
20. (take_image satellite0 planet8 instrument0 image2)
   added: (have_image planet8 image2)
   goals met: 7 of 10
21. (turn_to satellite2 star14 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star14)
   goals met: 7 of 10
22. (take_image satellite2 star14 instrument7 infrared0)
   added: (have_image star14 infrared0)
   goals met: 8 of 10
23. (turn_to satellite2 star16 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star16)
   goals met: 8 of 10
24. (take_image satellite2 star16 instrument7 infrared0)
   added: (have_image star16 infrared0)
   goals met: 9 of 10
25. (turn_to satellite2 star7 star16)
   deleted: (pointing satellite2 star16)
   added: (pointing satellite2 star7)
   goals met: 9 of 10
26. (take_image satellite2 star7 instrument7 spectrograph3)
   added: (have_image star7 spectrograph3)
   goals met: 10 of 10
